app/controllers/contatos_controller.rb

SELECT "contatos".* FROM "contatos"
---
  def index
    @contatos = Contato.all

INSERT INTO "contatos" ("nome", "email", "telefone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nome", ""], ["email", ""], ["telefone", ""], ["created_at", "2017-02-25 14:06:22.436393"], ["updated_at", "2017-02-25 14:06:22.436393"]]
---
  def create
    @contato = Contato.new(contato_params)

    respond_to do |format|
      if @contato.save

SELECT  "contatos".* FROM "contatos" WHERE "contatos"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_contato
      @contato = Contato.find(params[:id])